app/controllers/books_controller.rb

  def index
    render json: Book.all
---
SELECT "books".* FROM "books"

  def create
    # See comment in Borrowers controller
    @book = Book.create!(book_params)
---
INSERT INTO "books" ("ISBN", "author", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ISBN", "0807609560"], ["author", "Janet Frame"], ["created_at", "2014-09-25 09:08:34.890400"], ["title", "Owls do cry"], ["updated_at", "2014-09-25 09:08:34.890400"]]

  def show
    render json: Book.find(params[:id])
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 2]]